# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [30]:
import pandas as pd
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [16]:
cars1  = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv")
cars2  = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv")

In [17]:
cars1.sample(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
67,11.0,8,429,208,4633,11.0,72,1,mercury marquis,NaN,NaN,NaN,NaN,NaN
65,14.0,8,351,153,4129,13.0,72,1,ford galaxie 500,NaN,NaN,NaN,NaN,NaN
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN

In [18]:
cars2.sample(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
192,32.0,4,144,96,2665,13.9,82,3,toyota celica gt
10,13.0,8,318,150,3940,13.2,76,1,plymouth volare premier v8
170,27.0,4,112,88,2640,18.6,82,1,chevrolet cavalier wagon

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [ ]:
#cars1 = cars1.loc[:, "mpg" : 'car']
#cars1

In [19]:
columns_to_drop = ['Unnamed: 9','Unnamed: 10','Unnamed: 11','Unnamed: 12','Unnamed: 13']
cars1 = cars1.drop(columns=columns_to_drop)
cars1.sample(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
144,31.0,4,76,52,1649,16.5,74,3,toyota corona
26,10.0,8,307,200,4376,15.0,70,1,chevy c20

### Step 5. What is the number of observations in each dataset?

In [26]:
print(f"The number of column in cars1 is: {cars1.shape[1]} \nThe Number of the rows in cars1 is : {cars1.shape[0]}")

The number of column in cars1 is: 9
The Number of the rows in cars1 is : 198

In [27]:
print(f"The number of column in cars2 is: {cars2.shape[1]} \nThe Number of the rows in cars2 is : {cars2.shape[0]}")

The number of column in cars2 is: 9
The Number of the rows in cars2 is : 200

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [29]:
cars = pd.concat([cars1, cars2], ignore_index=True)
cars.sample(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
353,33.0,4,105,74,2190,14.2,81,2,volkswagen jetta
350,34.7,4,105,63,2215,14.9,81,1,plymouth horizon 4
227,19.0,6,225,100,3630,17.7,77,1,plymouth volare custom

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [35]:
np.random.seed(42)
owners_series = np.random.randint(15000, 73001, size=len(cars))

### Step 8. Add the column owners to cars

In [36]:
cars['owners'] = owners_series
cars.sample(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
147,24.0,4,90,75,2108,15.5,74,2,fiat 128,47482
164,21.0,6,231,110,3039,15.0,75,1,buick skyhawk,71873
54,35.0,4,72,69,1613,18.0,71,3,datsun 1200,58021